import type { Chapter } from "../../Γ Λυκείου/Methodology/Chapters";

type MathNode =
  // Α Λυκείου
  | "Εξίσωση 1ου Βαθμού"
  | "Κλασματική Εξίσωση"
  | "Παραμετρική Εξίσωση"
  | "Εξίσωση με Απόλυτα"
  | "Πολυωνυμική Εξίσωση"
  | "Επίλυση"
  | "Διερεύνηση";

type MathNodes = MathNode[];

type MathExercise = {
  chapter: Chapter["sub"];
  cases: {
    given: MathNodes;
    topics: {
      outcome_code: string;
      wanting: string;
      next: MathNodes;
      descr?: string;
    }[];
  }[];
};

const aLykAlgebraMethodology: MathExercise[] = [
  {
    chapter: "3.1",
    cases: [
      {
        given: ["Εξίσωση 1ου Βαθμού"],
        topics: [
          {
            outcome_code: "Αλ.Σχ.Γενικά",
            wanting: "Επίλυση απλής εξίσωσης 1ου βαθμού",
            next: ["Επίλυση"],
            descr: "Ασκήσεις της μορφής αx+b=0",
          },
          {
            outcome_code: "Αλ.Σχ.Γενικά",
            wanting: "Επίλυση κλασματικής εξίσωσης",
            next: ["Κλασματική Εξίσωση", "Επίλυση"],
            descr: "Εξισώσεις που περιέχουν κλάσματα και ανάγονται σε 1ου βαθμού.",
          },
          {
            outcome_code: "Αλ.Σχ.10.6",
            wanting: "Επίλυση πολυωνυμικής εξίσωσης που ανάγεται σε 1ου βαθμού",
            next: ["Πολυωνυμική Εξίσωση", "Επίλυση"],
            descr: "Παραγοντοποίηση και επίλυση.",
          },
        ],
      },
      {
        given: ["Παραμετρική Εξίσωση"],
        topics: [
          {
            outcome_code: "Αλ.Σχ.10.1",
            wanting: "Διερεύνηση και επίλυση παραμετρικής εξίσωσης 1ου βαθμού",
            next: ["Διερεύνηση", "Επίλυση"],
            descr: "Εξισώσεις της μορφής (λ-1)x = λ+1",
          },
          {
            outcome_code: "Αλ.Σχ.10.1",
            wanting: "Εύρεση παραμέτρου για συγκεκριμένη λύση",
            next: ["Επίλυση"],
          },
           {
            outcome_code: "Αλ.Σχ.10.1",
            wanting: "Εύρεση παραμέτρων ώστε η εξίσωση να είναι ταυτότητα ή αδύνατη",
            next: ["Διερεύνηση"],
          },
        ],
      },
      {
        given: ["Εξίσωση με Απόλυτα"],
        topics: [
          {
            outcome_code: "Αλ.Σχ.10.3",
            wanting: "Επίλυση εξίσωσης με απόλυτες τιμές",
            next: ["Εξίσωση με Απόλυτα", "Επίλυση"],
            descr: "Απλές και σύνθετες μορφές εξισώσεων με απόλυτα.",
          },
        ],
      },
    ],
  },
];
