type MathNode =
  | "Μονοτονία"
  | "Εξίσωση"
  | "Πράξεις"
  | "Παρατήρηση"
  | "Ταυτότητα"
  | "Συνάρτηση"
  | "Τιμή Συνάρτησης"
  | "Πεδίο Ορισμού"
  | "Σύνολο Τιμών"
  | "Γραφική Παράσταση"
  | "Ανίσωση"
  | "Συναρτησιακή Σχέση"
  | "Ακρότατο"
  | "Αντίστροφη Συνάρτηση"
  | "Πρόβλημα"
  | "Σύνθεση Συναρτήσεων"
  | "Άρτια - Περιττή"
  | "Θέτω"
  | "1-1";

type MathNodes = MathNode[];

type Chapter =
  | "Συναρτήσεις"
  | "Γραφική Παράσταση"
  | "Ίσες Συναρτήσεις"
  | "Πράξεις με Συναρτήσεις"
  | "Σύνθεση Συναρτήσεων"
  | "Μονοτονία"
  | "Ακρότατο"
  | "Άρτια και Περιττή Συνάρτηση"
  | "Συνάρτηση 1-1"
  | "Αντίστροφη Συνάρτηση";

type MathMethodology = {
  exercises: MathExercise[];
};

type MathExercise = {
  chapter: Chapter;
  cases: {
    given: MathNodes;
    topics: {
      wanting: string;
      next: MathNodes;
      descr?: string;
    }[];
  }[];
};

const gLykMethodology: MathMethodology = {
  exercises: [
    {
      chapter: "Συναρτήσεις",
      cases: [
        {
          given: ["Συνάρτηση"],
          topics: [
            {
              wanting: "Τιμή Συνάρτησης",
              next: ["Πράξεις"],
            },
            {
              wanting: "Εύρεση Παράμετρου Συνάρτησης από Τιμή της",
              next: ["Εξίσωση"],
            },
            {
              wanting: "Πεδίο Ορισμού",
              next: ["Εξίσωση", "Ανίσωση"],
            },
            { wanting: "Εύρεση Ριζών Συνάρτησης", next: ["Εξίσωση"] },
            {
              wanting: "Εύρεση Προσήμου Συνάρτησης",
              next: ["Ανίσωση"],
            },
            {
              wanting: "Έλεγχος Ύπαρξης Τιμής στο Σύνολο Τιμών Συνάρτησης",
              next: ["Εξίσωση"],
            },
          ],
        },
        {
          given: ["Πρόβλημα"],
          topics: [
            {
              wanting: "Κατασκευή Συνάρτησης από Πρόβλημα",
              next: ["Συνάρτηση"],
            },
          ],
        },
      ],
    },
    {
      chapter: "Γραφική Παράσταση",
      cases: [
        {
          given: ["Γραφική Παράσταση"],
          topics: [
            {
              wanting: "Πεδίο Ορισμού",
              next: ["Παρατήρηση"],
            },
            {
              wanting: "Εύρεση Συνόλου Τιμών Συνάρτησης",
              next: ["Παρατήρηση"],
            },
            {
              wanting: "Εύρεση Τιμών Συνάρτησης",
              next: ["Παρατήρηση"],
            },
            {
              wanting: "Εύρεση Ριζών Συνάρτησης",
              next: ["Παρατήρηση"],
            },
            {
              wanting: "Εύρεση Προσήμου Συνάρτησης",
              next: ["Παρατήρηση"],
            },
            {
              wanting: "Εύρεση Παραμέτρου Συνάρτησης",
              next: ["Παρατήρηση"],
            },
            {
              wanting: "Επίλυση Ανίσωσης",
              next: ["Παρατήρηση"],
            },
            {
              wanting: "Πλήθος Ριζών Εξίσωσης",
              next: ["Παρατήρηση"],
            },
          ],
        },
        {
          given: ["Γραφική Παράσταση"],
          topics: [
            {
              wanting: "Εύρεση Κοινών Σημείων",
              next: ["Παρατήρηση"],
            },
            {
              wanting: "Εύρεση Σχετικής Θέσης Συναρτήσεων",
              next: ["Παρατήρηση"],
            },
            {
              wanting: "Εύρεση Κατακόρυφης Απόστασης Συναρτήσεων",
              next: ["Παρατήρηση"],
            },
            {
              wanting: "Σχεδίαση Βασικών Συναρτήσεων",
              next: ["Παρατήρηση"],
            },
            {
              wanting: "Μετατόπιση Γραφικής Παράστασης",
              next: ["Παρατήρηση"],
            },
          ],
        },
      ],
    },
    {
      chapter: "Ίσες Συναρτήσεις",
      cases: [
        {
          given: ["Συνάρτηση"],
          topics: [
            {
              wanting: "Απόδειξη Ισότητας Συναρτήσεων",
              next: ["Ταυτότητα", "Πεδίο Ορισμού"],
            },
            {
              wanting: "Απόδειξη Μη Ισότητας Συναρτήσεων",
              next: ["Τιμή Συνάρτησης", "Πεδίο Ορισμού"],
            },
          ],
        },
      ],
    },
    {
      chapter: "Πράξεις με Συναρτήσεις",
      cases: [
        {
          given: ["Συνάρτηση"],
          topics: [
            {
              wanting: "Εύρεση Πρόσθεσης - Αφαίρεσης Συναρτήσεων",
              next: ["Πράξεις", "Πεδίο Ορισμού"],
            },
            {
              wanting: "Εύρεση Πολλαπλασιασμού Συναρτήσεων",
              next: ["Πράξεις", "Πεδίο Ορισμού"],
            },
            {
              wanting: "Εύρεση Διαίρεσης Συναρτήσεων",
              next: ["Πράξεις", "Πεδίο Ορισμού"],
            },
            {
              wanting: "Εύρεση Συνάρτησης Από Σχέση",
              next: ["Εξίσωση"],
            },
          ],
        },
      ],
    },
    {
      chapter: "Σύνθεση Συναρτήσεων",
      cases: [
        {
          given: ["Συνάρτηση"],
          topics: [
            {
              wanting: "Εύρεση Σύνθεσης Συναρτήσεων",
              next: ["Πράξεις", "Πεδίο Ορισμού"],
            },
            {
              wanting: "Εύρεση Σύνθεσης Δίκλαδων Συναρτήσεων",
              next: ["Πράξεις", "Πεδίο Ορισμού", "Ανίσωση"],
            },
          ],
        },
        {
          given: ["Σύνθεση Συναρτήσεων"],
          topics: [
            {
              wanting: "Εύρεση Συνάρτησης από Σύνθεση",
              next: ["Θέτω", "Εξίσωση"],
            },
            {
              wanting: "Έκφραση Συνάρτησης ως Σύνθεση Συναρτήσεων",
              next: ["Θέτω"],
            },
          ],
        },
        {
          given: ["Συναρτησιακή Σχέση"],
          topics: [
            {
              wanting: "Εύρεση Τιμών Συνάρτησης από Συναρτησιακή Σχέση",
              next: ["Πράξεις"],
            },
            {
              wanting: "Εύρεση Προσήμου Συνάρτησης από Συναρτησιακή Σχέση",
              next: [],
            },
          ],
        },
      ],
    },
    {
      chapter: "Μονοτονία",
      cases: [
        {
          given: ["Συνάρτηση"],
          topics: [
            {
              wanting: "Εύρεση Μονοτονίας",
              next: ["Ανίσωση"],
            },
            {
              wanting: "Αλγεβρική Απόδειξη Μονοτονίας Συνάρτησης",
              next: ["Ανίσωση"],
            },
            {
              wanting: "Σύγκριση Τιμών",
              next: ["Μονοτονία"],
            },
            {
              wanting: "Απόδειξη Ανισώσεων με Δοσμένη Συνάρτηση",
              next: ["Μονοτονία"],
            },
            {
              wanting: "Απόδειξη Σύνθετων Ανισώσεων",
              next: ["Μονοτονία"],
            },
            {
              wanting: "Εύρεση Μονοτονίας από Γνωστές Συναρτήσεις",
              next: ["Ανίσωση"],
            },
            {
              wanting: "Εύρεση Μονοτονίας από Πράξεις Συναρτήσεων",
              next: ["Ανίσωση"],
            },
            {
              wanting: "Εύρεση Ριζών",
              next: ["Μονοτονία", "Τιμή Συνάρτησης"],
            },
            {
              wanting: "Εύρεση Προσήμου",
              next: ["Μονοτονία", "Τιμή Συνάρτησης"],
            },
          ],
        },
        {
          given: ["Ανίσωση"],
          topics: [
            {
              wanting: "Επίλυση Ανίσωσης",
              next: ["Συνάρτηση"],
            },
          ],
        },
        {
          given: ["Συναρτησιακή Σχέση"],
          topics: [
            {
              wanting: "Εύρεση Μονοτονίας",
              next: ["Ανίσωση"],
            },
          ],
        },
      ],
    },
    {
      chapter: "Ακρότατο",
      cases: [
        {
          given: ["Γραφική Παράσταση"],
          topics: [
            {
              wanting: "Εύρεση Ακροτάτων",
              next: ["Παρατήρηση"],
            },
            {
              wanting: "Απόδειξη Ανισώσεων",
              next: ["Παρατήρηση"],
            },
          ],
        },
        {
          given: ["Συνάρτηση"],
          topics: [
            {
              wanting: "Εύρεση Ακροτάτων",
              next: ["Ανίσωση"],
            },
          ],
        },
        {
          given: ["Συνάρτηση"],
          topics: [
            {
              wanting: "Εύρεση Κατακόρυφης Απόστασης",
              next: ["Πράξεις"],
            },
          ],
        },
        {
          given: ["Ανίσωση"],
          topics: [
            {
              wanting: "Εύρεση Ακροτάτων",
              next: ["Τιμή Συνάρτησης"],
            },
          ],
        },
        {
          given: ["Ακρότατο"],
          topics: [
            {
              wanting: "Απόδειξη Ανίσωσης",
              next: [],
            },
            {
              wanting: "Επίλυση Εξίσωσης",
              next: [],
            },
            {
              wanting: "Εύρεση Παραμέτρων από μία Εξίσωση",
              next: [],
            },
          ],
        },
      ],
    },
    {
      chapter: "Άρτια και Περιττή Συνάρτηση",
      cases: [
        {
          given: ["Συνάρτηση"],
          topics: [
            {
              wanting: "Έλεγχος Άρτιας - Περιττής Συνάρτησης",
              next: [],
            },
            {
              wanting: "Απόδειξη Άρτιας - Περιττής Συνάρτησης",
              next: [],
            },
          ],
        },
        {
          given: ["Άρτια - Περιττή", "Ανίσωση"],
          topics: [
            {
              wanting: "Εύρεση Τιμής",
              next: [],
            },
          ],
        },
        {
          given: ["Συναρτησιακή Σχέση"],
          topics: [
            {
              wanting: "Έλεγχος Άρτιας - Περιττής Συνάρτησης",
              next: [],
            },
          ],
        },
      ],
    },
    {
      chapter: "Συνάρτηση 1-1",
      cases: [
        {
          given: ["Συνάρτηση"],
          topics: [
            {
              wanting: "Έλεγχος Συνάρτησης 1-1",
              next: [],
            },
            {
              wanting: "Απόδειξη Συνάρτησης 1-1",
              next: [],
            },
            {
              wanting: "Επίλυση Εξίσωσης",
              next: [],
            },
          ],
        },
        {
          given: ["Γραφική Παράσταση"],
          topics: [
            {
              wanting: "Επίλυση Εξίσωσης",
              next: [],
            },
          ],
        },
        {
          given: ["Σύνθεση Συναρτήσεων"],
          topics: [
            {
              wanting: "Απόδειξη Συνάρτησης 1-1",
              next: [],
            },
          ],
        },
        {
          given: ["Συναρτησιακή Σχέση"],
          topics: [
            {
              wanting: "Απόδειξη Συνάρτησης 1-1",
              next: [],
            },
          ],
        },
      ],
    },
    {
      chapter: "Αντίστροφη Συνάρτηση",
      cases: [
        {
          given: ["Γραφική Παράσταση"],
          topics: [
            {
              wanting: "Ύπαρξη Αντίστροφης Συνάρτησης",
              next: ["Παρατήρηση"],
              descr:
                "Κάθε οριζόντια γραμμή τέμνει τη γραφική παράσταση το πολύ μία φορά.",
            },
            {
              wanting: "Εύρεση Πεδίου Ορισμού Αντίστροφης Συνάρτησης",
              next: ["Παρατήρηση"],
              descr: "Κοιτάμε τα σημεία του άξονα y.",
            },
            {
              wanting: "Εύρεση Συνόλου Τιμών Αντίστροφης Συνάρτησης",
              next: ["Παρατήρηση"],
              descr: "Κοιτάμε τα σημεία του άξονα x.",
            },
            {
              wanting: "Εύρεση Τιμών Αντίστροφης Συνάρτησης",
              next: ["Παρατήρηση"],
              descr: "Μας δίνει y και ζητάμε x.",
            },
            {
              wanting: "Γραφική Παράσταση Αντίστροφης Συνάρτησης",
              next: ["Παρατήρηση"],
              descr: "Συμμετρία ως προς τη γραμμή y=x.",
            },
          ],
        },
        {
          given: ["Συνάρτηση"],
          topics: [
            {
              wanting: "Ύπαρξη Αντίστροφης Συνάρτησης",
              next: ["1-1"],
              descr: "Δείχνουμε ότι η συνάρτηση είναι 1-1.",
            },
            {
              wanting: "Εύρεση Αντίστροφης Συνάρτησης",
              next: ["Εξίσωση"],
              descr: "Λύνουμε την εξίσωση y=f(x) ως προς x.",
            },
            {
              wanting: "Γραφική Παράσταση Αντίστροφης Συνάρτησης",
              next: ["Γραφική Παράσταση"],
              descr: "Συμμετρία ως προς τη γραμμή y=x.",
            },
            {
              wanting:
                "Εύρεση Κοινών Σημείων Συνάρτησης και Αντίστροφης Συνάρτησης",
              next: ["Εξίσωση"],
              descr: "Λύνουμε την εξίσωση f(x)=x. Ίσως και αλλού",
            },
            {
              wanting: "Εύρεση Κοινών Σημείων Συνάρτησης και y=x",
              next: ["Εξίσωση"],
              descr: "Λύνουμε την εξίσωση f^{-1}(x)=x.",
            },
            {
              wanting: "Εύρεση Αντίστροφης Δίκλαδης Συνάρτησης",
              next: ["Εξίσωση"],
              descr: "Λύνουμε την εξίσωση y=f(x) ως προς x για κάθε κλάδο.",
            },
            {
              wanting: "Εύρεση Τιμής Αντίστροφης Συνάρτησης",
              next: ["Πράξεις"],
              descr: "Περνάμε f",
            },
            {
              wanting: "Εύρεση Ριζών Αντίστροφης Συνάρτησης",
              next: ["Πράξεις"],
              descr: "Βρίσκουμε f(0)",
            },
            {
              wanting: "Εύρεση Προσήμου Αντίστροφης Συνάρτησης",
              next: ["Ανίσωση"],
              descr: "Περνάμε f",
            },
            {
              wanting: "Εύρεση Μονοτονίας Αντίστροφης Συνάρτησης",
              next: ["Ανίσωση"],
              descr: "Από μονοτονία της f",
            },
          ],
        },
        {
          given: ["Εξίσωση", "Αντίστροφη Συνάρτηση"],
          topics: [
            {
              wanting: "Επίλυση Εξίσωσης",
              next: ["Πράξεις"],
              descr: "Περνάμε f",
            },
          ],
        },
        {
          given: ["Ανίσωση", "Αντίστροφη Συνάρτηση"],
          topics: [
            {
              wanting: "Επίλυση Ανίσωσης",
              next: ["Ανίσωση"],
              descr: "Περνάμε f",
            },
          ],
        },
        {
          given: ["Ανίσωση", "Συνάρτηση", "Αντίστροφη Συνάρτηση"],
          topics: [
            {
              wanting: "Επίλυση Ανίσωσης",
              next: ["Μονοτονία"],
              descr: "Κατασκευάζουμε νέα συνάρτηση",
            },
          ],
        },
        {
          given: ["Συναρτησιακή Σχέση"],
          topics: [
            {
              wanting: "Εύρεση Αντίστροφης Συνάρτησης",
              next: ["Εξίσωση"],
              descr: "Λύνουμε την εξίσωση y=f(x) ως προς x.",
            },
            {
              wanting: "Εύρεση Κοινών Σημείων Συνάρτησης και y=x",
              next: ["Εξίσωση"],
              descr: "Θέτουμε f(x)=x.",
            },
            {
              wanting:
                "Εύρεση Κοινών Σημείων Συνάρτησης και Αντίστροφης Συνάρτησης",
              next: ["Εξίσωση"],
              descr: "Θέτουμε f^{-1}(x)=f(x)=x.",
            },
          ],
        },
      ],
    },
  ],
};
